# -*- coding: utf-8 -*-
"""Python basics HW8 Task 2.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1l2ZjDZXYMWFNwevcVRnQOYk5vy1KxlS3

2. Создайте собственный класс-исключение, обрабатывающий ситуацию деления на нуль. Проверьте его работу на данных, вводимых пользователем. При вводе пользователем нуля в качестве делителя программа должна корректно обработать эту ситуацию и не завершиться с ошибкой.
"""

class UserException(Exception):
    pass

a, b = map(float, input('Введите числа через пробел \n').split(' '))
try:
    if b == 0:
        raise UserException('На ноль делить нельзя')
    else:
        print('Результат деления: ', (a / b))
except UserException as error:
    print(error)