# -*- coding: utf-8 -*-
"""Python basics HW6 Task 4.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1kO3VfM3HDuRulxcZA4TtFon6alSd_fKy

4. Реализуйте базовый класс Car. У данного класса должны быть следующие атрибуты: speed, color, name, is_police (булево). А также методы: go, stop, turn(direction), которые должны сообщать, что машина поехала, остановилась, повернула (куда). Опишите несколько дочерних классов: TownCar, SportCar, WorkCar, PoliceCar. Добавьте в базовый класс метод show_speed, который должен показывать текущую скорость автомобиля. Для классов TownCar и WorkCar переопределите метод show_speed. При значении скорости свыше 60 (TownCar) и 40 (WorkCar) должно выводиться сообщение о превышении скорости.
"""

class Car:
    def __init__(self, speed, color, name, is_police=False):
        self.speed = speed
        self.color = color
        self.name = name
        self.is_police = is_police

    def go(self):
        return f'Машина поехала'  

    def stop(self):
        return f'Машина остановилась'          

    def chdir(self, direction):
        return f'Машина повернула {direction}' 

    def show_speed(self):
        return f'Текущая скорость равна {self.speed}'


class TownCar(Car):
    def __init__(self, speed, color, name):
        self.speed = speed
        self.color = color
        self.name = name
        self.is_police = False
    
    def show_speed(self):
        if self.speed > 60:
            return f'Скорость превышена!'
        else:
            return f'Текущая скорость равна {self.speed}'


class WorkCar(Car):
    def __init__(self, speed, name, is_police=False):
        self.speed = speed
        self.name = name
        self.is_police = is_police 
        self.color = 'black'   

    def show_speed(self):
        if self.speed > 40:
            return f'Скорость превышена!'
        else:
            return f'Текущая скорость равна {self.speed}'


class SportCar(Car):
    def __init__(self, speed, color, name):
        self.speed = speed
        self.color = color
        self.name = name
        self.is_police = False


class PoliceCar(Car):

    def __init__(self, speed, color, name):
        self.speed = speed
        self.color = color
        self.name = name
        self.is_police = True

"""Создайте экземпляры классов, передайте значения атрибутов. Выполните доступ к атрибутам, выведите результат. Выполните вызов методов и также покажите результат."""

my_usual_car = TownCar(100, 'yellow', 'pobeda')

my_usual_car.name

my_usual_car.color

my_usual_car.speed

my_usual_car.show_speed()

my_sport_car = SportCar(300, 'jaguar', 'red')

print(my_sport_car.color, my_sport_car.is_police, my_sport_car.name)

my_sport_car.show_speed()

patrol_car = PoliceCar(80, 'green', 'honda')

patrol_car.go()

patrol_car.chdir('налево')

patrol_car.show_speed()

shuttle = WorkCar(speed=60, name='mercedes')

shuttle.color

shuttle.show_speed()

shuttle.is_police