# -*- coding: utf-8 -*-
"""Python basics HW3 Task 6.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1Wt52VssIn0b7JgcPwKTS5Fr2ahjIlJZH

Реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же, но с прописной первой буквой. Например, print(int_func(‘text’)) -> Text. Продолжить работу над заданием. В программу должна попадать строка из слов, разделенных пробелом. Каждое слово состоит из латинских букв в нижнем регистре. Сделать вывод исходной строки, но каждое слово должно начинаться с заглавной буквы. Необходимо использовать написанную ранее функцию int_func().
"""

def int_func(word):
    # while not word.isalpha() or not word.islower() or not word.isascii():
    #     word = input('Вы ввели что-то не то, введите слово из маленьких латинских букв \n')
    # Не получилось таким образом проверять ввод, хотя в одной из предыдущих задач что-то подобное сработало
    userlist = list(word)
    return userlist[0].upper() + ''.join(userlist[1:])

def int_func_sentence():
    userstring = input('Введите строку из слов, разделенных пробелами \n').split(' ')
# for i in userstring:
#       while not i.isalpha() or not i.islower() or not i.isascii():
#           userstring = input('Вы ввели что-то не то, введите слова маленькими латинскими буквами \n')
# В итоге не получилось реализовать проверку введенных данных таким образом ни внутри функции int_func(), ни здесь. 
# Решила сделать вместо этого завершение программы с сообщением об ошибке, но вопрос остался.
    for i in userstring:
        if not i.isalpha() or not i.islower() or not i.isascii():
            print('Вы ввели что-то не то')
            break
    else:
        altered = []
        for i in userstring:
            altered.append(int_func(i))    
        return ' '.join(altered)

int_func_sentence()