# -*- coding: utf-8 -*-
"""Python basics HW8 Task 1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1RDzdPBttLJuTY7rBgd5cPNvFSiPp7Kk9

1. Реализовать класс «Дата», функция-конструктор которого должна принимать дату в виде строки формата «день-месяц-год». В рамках класса реализовать два метода. Первый, с декоратором @classmethod, должен извлекать число, месяц, год и преобразовывать их тип к типу «Число». Второй, с декоратором @staticmethod, должен проводить валидацию числа, месяца и года (например, месяц — от 1 до 12). Проверить работу полученной структуры на реальных данных.
"""

class Date:
    def __init__(self, date):
        self.validate(date)

    @classmethod
    def format_date(cls, date):
        day, month, year = map(int, date.split('-'))
        return day, month, year

    @staticmethod
    def validate(date):
        day, month, year = Date.format_date(date)
        valid_year = year in range(1901, 2022)       
        valid_month = month in range(1, 13)
        valid_day = day in range(1, 32)
        if valid_year == True and valid_month == True and valid_day == True:
            print('Корректная дата')
            return True
        else:
            print('Дата указана некорректно')
            return False

Date('33-12-2021')

Date('01-01-1901')

Date('02-32-1999')

Date('00-11-2001')

Date('31-12-1901')

Date('01-12-1901')

Date('01-12-1900')

Date('01-12-2040')

Date('01-12-2021')

Date('01-12-2022')