# -*- coding: utf-8 -*-
"""Python basics HW3 Task 3.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1Z3lwLFPXr8n9nboNTevCMvIE6qjW9lGX

Реализовать функцию my_func(), которая принимает три позиционных аргумента, и возвращает сумму наибольших двух аргументов.
"""

def my_func(n1, n2, n3):
    sumlargest = n1 + n2 + n3 - min(n1, n2, n3)
    # print(sumlargest)
    return sumlargest

my_func(0.11, 0.21, 8.249448)