# -*- coding: utf-8 -*-
"""Python basics HW4 Task 5.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1zJ6namaQvG-oinTKcPFHePaGm9jiI-Y_

5. Реализовать формирование списка, используя функцию range() и возможности генератора. В список должны войти четные числа от 100 до 1000 (включая границы). Необходимо получить результат вычисления произведения всех элементов списка.
Подсказка: использовать функцию reduce().
"""

from functools import reduce

def multiply(prev_el, el):
    return prev_el * el

num_list = [i for i in range(100, 1001) if i % 2 == 0]

print(reduce(multiply, num_list))