# -*- coding: utf-8 -*-
"""Python basics HW6 Task 1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/109kyLPdeJJIL1jONOSdqoOYhjkY7dFuQ

1. Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск). Атрибут реализовать как приватный. В рамках метода реализовать переключение светофора в режимы: красный, желтый, зеленый. Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды, третьего (зеленый) — на ваше усмотрение. Переключение между режимами должно осуществляться только в указанном порядке (красный, желтый, зеленый). Проверить работу примера, создав экземпляр и вызвав описанный метод.
Задачу можно усложнить, реализовав проверку порядка режимов, и при его нарушении выводить соответствующее сообщение и завершать скрипт.
"""

from time import sleep

class TrafficLight:
    __color = "Красный" 
   
    def running(self):
        while True:
            self.__color = 'Красный'
            print(f'{self.__color} свет')
            sleep(7)
            self.__color = 'Желтый'
            print(f'{self.__color} свет')
            sleep(2)
            self.__color = 'Зеленый'
            print(f'{self.__color} свет')
            sleep(9)
            self.__color = 'Желтый'
            print(f'{self.__color} свет')
            sleep(2)

light = TrafficLight()
light.running()