# -*- coding: utf-8 -*-
"""Python basics HW3 Task 1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1MnMnt08HVZYMFdIbeuESteZ_dHqYmOKq

Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление. Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.
"""

# не поняла, что значит "функция принимает два числа", но при этом "запрашивать числа у пользователя"

def divide(f1, f2):
    # f1 = int(input('Введите делимое \n'))
    # f2 = int(input('Введите делитель \n'))

    while f2 == 0:
      if f2 == 0:
          f2 = int(input('Делить на ноль нельзя! Введите другой делитель \n'))

    print(f'Результат деления: {f1 / f2}')

divide(int(input('Введите делимое \n')), int(input('Введите делитель \n')))