# -*- coding: utf-8 -*-
"""Python basics HW8 Task 3.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1A-xA9FdeFZBNfpZW4n6wBEhsRh2JepRB

Создайте собственный класс-исключение, который должен проверять содержимое списка на наличие только чисел. Проверить работу исключения на реальном примере. Необходимо запрашивать у пользователя данные и заполнять список. Класс-исключение должен контролировать типы данных элементов списка.


Примечание: длина списка не фиксирована. Элементы запрашиваются бесконечно, пока пользователь сам не остановит работу скрипта, введя, например, команду “stop”. При этом скрипт завершается, сформированный список выводится на экран.


Подсказка: для данного задания примем, что пользователь может вводить только числа и строки. При вводе пользователем очередного элемента необходимо реализовать проверку типа элемента и вносить его в список, только если введено число. Класс-исключение должен не позволить пользователю ввести текст (не число) и отобразить соответствующее сообщение. При этом работа скрипта не должна завершаться.
"""

class TypeController(Exception):    
    @staticmethod
    def is_number(string):
        try:
            float(string)
            return True
        except ValueError:
            return False

userlist = []
while True:
    new_element = input('Введите число или q, чтобы завершить работу \n')
    if new_element == 'q':
        break
    try:
        if TypeController.is_number(new_element):
            userlist.append(float(new_element))
        else:
            raise TypeController(f'{new_element} не является числом')            
    except TypeController as error:
        print(error)
        continue
print(userlist)