# -*- coding: utf-8 -*-
"""Python basics HW 7 Task 1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1s3SbfQu9BoQZCY1E0wC_fUiZzqQBRNrt

Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init__()), который должен принимать данные (список списков) для формирования матрицы.

Подсказка: матрица — система некоторых математических величин, расположенных в виде прямоугольной схемы.

Примеры матриц вы найдете в методичке.

Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном виде.

Далее реализовать перегрузку метода __add__() для реализации операции сложения двух объектов класса Matrix (двух матриц). Результатом сложения должна быть новая матрица.

Подсказка: сложение элементов матриц выполнять поэлементно — первый элемент первой строки первой матрицы складываем с первым элементом первой строки второй матрицы и т.д.
"""

class Matrix():

    def __init__(self, userlist):
        if type(userlist) == list:
            for elem in userlist:
                if type(elem) == list:
                    if not len(elem) == len(userlist[userlist.index(elem) - 1]):
                        return 'Число элементов в списках различается'
                        break
                    else:
                        self.data = userlist                        
                else:
                    return 'Введите список списков'
                    break
        else:
            return 'Введите список списков'

    def __str__(self):
        for sequence in self.data:
            print('\t'.join(str(elem) for elem in sequence), '\n')  # я не поняла и не смогла разобраться, как это выполнить с помощью return

    def __add__(self, other):
        if not len(self.data) == len(other.data):
            return 'Ошибка, размерность матриц не совпадает'            
        else:
            for i in range(len(self.data)):
                if not len(self.data[i]) == len(other.data[i]):
                    print('Ошибка, размерность матриц не совпадает')
                    break
                else:
                    res = []
                    for sequence in self.data:
                        s = self.data.index(sequence)
                        lst = []
                        for elem in sequence:
                            n = sequence.index(elem)
                            # print((elem + matrix_b[s][n]))
                            lst.append(elem + other.data[s][n])
                        res.append(lst)
                    return Matrix(res)

matrix_1 = Matrix([[1, 10], [200, 500], [-3, -333]])

matrix_2 = Matrix([[0, 1], [4, 6], [-100, -1]])

print(matrix_1 + matrix_2)