# -*- coding: utf-8 -*-
"""Python basics HW4 Task 1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1wIeuylunIZF6EqXGcqf7HAhBb3wh1WAD

1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника. В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия. Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.
"""

from sys import argv

script_name, work_hours, hourly_rate, bonus = argv

print(f'Заработная плата сотрудника составит {int(work_hours) * float(hourly_rate) + int(bonus)} руб')