# -*- coding: utf-8 -*-
"""Python basics HW3 Task 2.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/18Mvw6nmitVoNwNxkIT9I_ZYKQe5BFAwW

Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя: имя, фамилия, год рождения, город проживания, email, телефон. Функция должна принимать параметры как именованные аргументы. Реализовать вывод данных о пользователе одной строкой.
"""

def getdata(name, surname, year, city, email, phone):
    print(f'Имя пользователя: {name}, фамилия: {surname}, год рождения: {year}, город проживания: {city}, email: {email}, телефон: {phone}')

newstring = str(getdata(name='anne', surname='smith', year=1990, city='minsk', email='i@i.i', phone='3-16-70')) # буквально "одной строкой"
print(type(newstring))