# -*- coding: utf-8 -*-
"""Python basics HW4 Task 6.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/181iWVAXa59R-_HQSJxR7GX7o4aRymRfA

6. Реализовать два небольших скрипта:
а) итератор, генерирующий целые числа, начиная с указанного,
б) итератор, повторяющий элементы некоторого списка, определенного заранее.
Подсказка: использовать функцию count() и cycle() модуля itertools. Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл. Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.
"""

import itertools

def iterate(first, last):
    iterlist = []
    for el in itertools.count(first):
        if el >= last + 1:    # добавила единицу, чтобы захватывать верхнюю границу
            break
        else:
            print(el)
            iterlist.append(el)
    return iterlist, len(iterlist)

iterate(2,16)

a, b, limit = [int(s) for s in input('Введите числа через пробел: ').split()]
sym_list = [chr(i) for i in range(int(a), int(b))]
n = 0
for el in itertools.cycle(sym_list):
    if n == int(limit):
        break
    print(el)
    n += 1